<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
  <key>Comment</key>
  <string>Child of download parent.</string>

  <key>Description</key>
  <string>Downloads the latest version of Mendeley Reference Manager and creates a package.</string>

  <key>Identifier</key>
  <string>org.rgba.recipes.pkg.MendeleyReferenceManager</string>

  <key>Input</key>
  <dict>
    <key>NAME</key>
    <string>Mendeley Reference Manager</string>
  </dict>

  <key>MinimumVersion</key>
  <string>2.3</string>

  <key>ParentRecipe</key>
  <string>org.rgba.recipes.download.MendeleyReferenceManager</string>

  <key>Process</key>
  <array>
    <dict>
      <key>Processor</key>
      <string>AppPkgCreator</string>
    </dict>
  </array>
</dict>
</plist>