<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
  <key>Comment</key>
  <string>Autodiscover Mendeley Reference Manager DMG and version</string>

  <key>Description</key>
  <string>Downloads the latest version of Mendeley Reference Manager by scraping the Mendeley macOS download page.</string>

  <key>Identifier</key>
  <string>org.rgba.recipes.download.MendeleyReferenceManager</string>

  <key>Input</key>
  <dict>
    <key>NAME</key>
    <string>Mendeley Reference Manager</string>
  </dict>

  <key>MinimumVersion</key>
  <string>2.3</string>

  <key>Process</key>
  <array>

    <!-- 1) Use URLDownloader with download_regex to find the absolute static DMG URL on the page -->
    <dict>
      <key>Arguments</key>
      <dict>
        <!-- page that contains the anchor to the static DMG -->
        <key>url</key>
        <string>https://www.mendeley.com/download-reference-manager/macOS</string>

        <!--
          Regex applied to the downloaded HTML to find the full DMG URL.
          Matches e.g.:
            https://static.mendeley.com/bin/desktop/mendeley-reference-manager-2.143.0-universal.dmg
        -->
        <key>download_regex</key>
        <string>https://static\.mendeley\.com/bin/desktop/mendeley-reference-manager-[0-9]+\.[0-9]+\.[0-9]+-universal\.dmg</string>

        <!-- Output filename in the AutoPkg cache. Use %NAME%.dmg so it works without a pre-known %version%. -->
        <key>filename</key>
        <string>%NAME%.dmg</string>

        <!-- Optional: If multiple matches exist, uncomment and set which one to use (1-based). -->
        <!-- <key>download_match_number</key>
        <integer>1</integer> -->
      </dict>
      <key>Processor</key>
      <string>URLDownloader</string>
    </dict>

    <!-- End of check phase -->
    <dict>
      <key>Processor</key>
      <string>EndOfCheckPhase</string>
    </dict>

    <!-- Verify signature -->
    <dict>
      <key>Arguments</key>
      <dict>
        <key>input_path</key>
        <string>%pathname%/Mendeley Reference Manager.app</string>
        <key>requirement</key>
        <string>identifier "com.elsevier.mendeley" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "45K89Y5X9B"</string>
      </dict>
      <key>Processor</key>
      <string>CodeSignatureVerifier</string>
    </dict>

    <!-- Extract version from app Info.plist (this is a good cross-check) -->
    <dict>
      <key>Arguments</key>
      <dict>
        <key>input_plist_path</key>
        <string>%pathname%/Mendeley Reference Manager.app/Contents/Info.plist</string>
        <key>plist_version_key</key>
        <string>CFBundleShortVersionString</string>
      </dict>
      <key>Processor</key>
      <string>Versioner</string>
    </dict>

  </array>
</dict>
</plist>