<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v2.5.0 (https://github.com/homebysix/recipe-robot) — modified to use URLTextSearcher</string>
	<key>Description</key>
	<string>Downloads the latest version of Mendeley Reference Manager.</string>
	<key>Identifier</key>
	<string>org.rgba.recipes.download.MendeleyReferenceManager</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Mendeley Reference Manager</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.3</string>
	<key>Process</key>
	<array>

		<!-- Discover the latest .dmg URL on the Mendeley macOS download page -->
		<dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<!-- Page that contains the static.mendeley link -->
				<key>url</key>
				<string>https://www.mendeley.com/download-reference-manager/macOS</string>

				<!-- Provide browser-like request headers to avoid being served an anti-bot page -->
				<key>request_headers</key>
				<dict>
					<key>User-Agent</key>
					<string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/605.1.15 (KHTML, like Gecko) Version/16.0 Safari/605.1.15</string>
					<key>Accept</key>
					<string>text/html,application/xhtml+xml,application/xml;q=0.9,*/*;q=0.8</string>
				</dict>

				<!--
					Required: regex with:
					- group 1 = full dmg URL (used as %url%)
					- group 2 = version string (optional, written to %version%)
				-->
				<key>re_pattern</key>
				<string>(https://static\.mendeley\.com/bin/desktop/mendeley-reference-manager-([0-9]+\.[0-9]+(?:\.[0-9]+)*)-universal\.dmg)</string>

				<!-- Write the full URL (group 1) to %url% -->
				<key>result_output_variable</key>
				<string>url</string>

				<!-- Write the version (group 2) to %version% (optional) -->
				<key>version_output_variable</key>
				<string>version</string>
			</dict>
		</dict>

		<!-- Download the discovered URL (with browser-like headers) -->
		<dict>
			<key>Arguments</key>
			<dict>
				<!-- use discovered URL -->
				<key>url</key>
				<string>%url%</string>

				<!-- keep filename unchanged for minimal edits -->
				<key>filename</key>
				<string>%NAME%.dmg</string>

				<!-- pass the same request headers to the downloader -->
				<key>request_headers</key>
				<dict>
					<key>User-Agent</key>
					<string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/605.1.15 (KHTML, like Gecko) Version/16.0 Safari/605.1.15</string>
					<key>Accept</key>
					<string>text/html,application/xhtml+xml,application/xml;q=0.9,*/*;q=0.8</string>
				</dict>

			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>

		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>

		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/Mendeley Reference Manager.app</string>
				<key>requirement</key>
				<string>identifier "com.elsevier.mendeley" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "45K89Y5X9B"</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>

		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%pathname%/Mendeley Reference Manager.app/Contents/Info.plist</string>
				<key>plist_version_key</key>
				<string>CFBundleShortVersionString</string>
			</dict>
			<key>Processor</key>
			<string>Versioner</string>
		</dict>

	</array>
</dict>
</plist>