<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Local override — single-file pkg recipe that discovers and downloads Mendeley DMG, then builds pkg.</string>
	<key>Description</key>
	<string>Downloads the latest version of Mendeley Reference Manager and creates a package (self-contained override).</string>
	<key>Identifier</key>
	<string>org.rgba.recipes.pkg.MendeleyReferenceManager</string>

	<!-- Keep NAME input so processors and AppPkgCreator keep working -->
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Mendeley Reference Manager</string>
	</dict>

	<key>MinimumVersion</key>
	<string>2.3</string>

	<!-- NOTE: ParentRecipe intentionally removed so this override is self-contained -->
	<key>Process</key>
	<array>

		<!-- 1) Discover the dmg URL and version on the Mendeley page -->
		<dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://www.mendeley.com/download-reference-manager/macOS</string>

				<!-- Browser-like headers to avoid anti-bot HTML -->
				<key>request_headers</key>
				<dict>
					<key>User-Agent</key>
					<string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/605.1.15 (KHTML, like Gecko) Version/16.0 Safari/605.1.15</string>
					<key>Accept</key>
					<string>text/html,application/xhtml+xml,application/xml;q=0.9,*/*;q=0.8</string>
				</dict>

				<!-- group 1 = full URL, group 2 = version -->
				<key>re_pattern</key>
				<string>(https://static\.mendeley\.com/bin/desktop/mendeley-reference-manager-([0-9]+\.[0-9]+(?:\.[0-9]+)*)-universal\.dmg)</string>

				<key>result_output_variable</key>
				<string>url</string>

				<key>version_output_variable</key>
				<string>version</string>
			</dict>
		</dict>

		<!-- 2) Download discovered URL (with same headers) -->
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%url%</string>

				<!-- keep the filename you prefer; changed to include version if you want -->
				<key>filename</key>
				<string>%NAME%.dmg</string>

				<key>request_headers</key>
				<dict>
					<key>User-Agent</key>
					<string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/605.1.15 (KHTML, like Gecko) Version/16.0 Safari/605.1.15</string>
					<key>Accept</key>
					<string>text/html,application/xhtml+xml,application/xml;q=0.9,*/*;q=0.8</string>
				</dict>
			</dict>
		</dict>

		<!-- 3) End of check phase -->
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>

		<!-- 4) Verify code signature of the app inside the mounted image -->
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/Mendeley Reference Manager.app</string>
				<key>requirement</key>
				<string>identifier "com.elsevier.mendeley" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "45K89Y5X9B"</string>
			</dict>
		</dict>

		<!-- 5) Get version from app bundle (Versioner) -->
		<dict>
			<key>Processor</key>
			<string>Versioner</string>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%pathname%/Mendeley Reference Manager.app/Contents/Info.plist</string>
				<key>plist_version_key</key>
				<string>CFBundleShortVersionString</string>
			</dict>
		</dict>

		<!-- 6) Create package from the app -->
		<dict>
			<key>Processor</key>
			<string>AppPkgCreator</string>
		</dict>

	</array>
</dict>
</plist>